Repository: trifectatechfoundation/sudo-rs
Catalog: po/*.po
Languages: nl, pl

source: Sorry, user {user} is not allowed to execute '{command}' as {other_user} on {hostname}.
nl: Sorry, gebruiker {user} mag '{command}' niet uitvoeren als {other_user} op {hostname}
pl: Niestety, użytkownik {user} nie ma uprawnień do wykonywania polecenia „{command}” jako {other_user} na {hostname}.

source: Sorry, user {user} may not run {command} on {hostname}.
nl: Sorry, gebruiker {user} mag {command} niet uitvoeren op {hostname}.
pl: Niestety, użytkownik {user} nie może uruchomić {command} na {hostname}.

source: sudo must be owned by uid 0 and have the setuid bit set
nl: sudo moet eigendom zijn van uid 0 en de setuid bit gezet hebben
pl: sudo musi być własnością uid 0 i mieć ustawiony bit setuid

source: '{path}': command not found
nl: '{path}': opdracht niet gevonden
pl: „{path}”: nie znaleziono polecenia

source: '{path}': invalid command
nl: '{path}': ongeldige opdracht
pl: „{path}”: nieprawidłowe polecenie

source: user '{user}' not found
nl: gebruiker '{user}' niet gevonden
pl: nie znaleziono użytkownika „{user}”

source: group '{group}' not found
nl: groep '{group}' niet gevonden
pl: nie znaleziono grupy „{group}”

source: I'm sorry {user}. I'm afraid I can't do that
nl: Het spijt me, {user}. Ik ben bang dat ik dat niet kan doen.
pl: Przepraszam, {user}. Obawiam się, że nie mogę tego zrobić

source: interactive authentication is required
nl: interactieve authenticatie is vereist
pl: wymagane jest uwierzytelnianie interaktywne

source: you are not allowed to set the following environment variables:
nl: het is niet toegestaan de volgende omgevingsvariabelen te zetten:
pl: nie możesz ustawić następujących zmiennych środowiskowych:

source: cannot execute '{path}': {error}
nl: kan '{path}' niet uitvoeren: {error}
pl: nie można wykonać „{path}”: {error}

source: IO error: {error}
nl: Invoer/uitvoer-fout: {error}
pl: Błąd wejścia-wyjścia: {error}

source: maximum {num} incorrect authentication attempts
nl: maximum van {num} authenticatiepogingen bereikt
pl: maksimum nieudanych prób uwierzytelnienia: {num}

source: you are not allowed to use '--chdir {path}' with '{command}'
nl: het is niet toegestaan '--chdir {path}' te gebruiken met '{command}'
pl: nie możesz używać „--chdir {path}” z „{command}”

source: Unexpected null character in input
nl: Onverwachte NUL-byte in input
pl: Nieoczekiwany znak null w danych wejściowych

source: unable to change AppArmor profile to {profile}: {error}
nl: kan AppArmor profiel niet omzeten naar {profile}: {error}
pl: nie można zmienić profilu AppArmor na {profile}: {error}

source: unable to change directory to {path}: {error}
nl: kan niet naar map {path} gaan: {error}
pl: nie można zmienić katalogu na {path}: {error}

source: Failed to run askpass program {path}: {error}
nl: Kon askpass programma {path} niet starten: {error}
pl: Nie udało się uruchomić programu pytającego o hasło {path}: {error}

source: input needed
nl: input nodig
pl: potrzebne dane wejściowe

source: Could not read input data as UTF-8 string
nl: Kon input data niet als UTF-8 verwerken
pl: Nie można odczytać danych wejściowych w postaci ciągu UTF-8

source: Account validation failure, is your account locked?
nl: Je account kon niet gevalideerd worden, is het soms gelockt?
pl: Błąd weryfikacji konta. Czy to konto zostało zablokowane?

source: Account or password is expired, reset your password and try again
nl: Account of wachtwoord verlopen, reset je wachtwoord en probeer opnieuw
pl: Konto lub hasło wygasło. Zresetuj hasło i spróbuj ponownie

source: Password expired, contact your system administrator
nl: Wachtwoord is verlopen, neem contact op met de systeembeheerder
pl: Hasło wygasło, skontaktuj się z administratorem systemu

source: PAM error: {error}
nl: PAM-fout: {error}
pl: Błąd PAM: {error}

source: A terminal is required to authenticate
nl: Een terminal is nodig om te authenticeren
pl: Terminal jest wymagany do uwierzytelnienia

source: It was not possible to get a list of environment variables
nl: Het was niet mogelijk de omgevingsvariabelen op te halen
pl: Nie udało się uzyskać listy zmiennych środowiskowych

source: Interaction is required
nl: Interactie is vereist
pl: Wymagana jest interakcja

source: Authentication required but not attempted
nl: Authenticatie is vereist maar niet geprobeerd
pl: Wymagane uwierzytelnienie, ale nie zostało podjęte

source: Incorrect authentication attempt
nl: Onjuiste authenticatiepoging
pl: Nieprawidłowa próba uwierzytelnienia

source: timed out
nl: duurde te lang
pl: upłynął limit czasu

source: Sorry, user {user} is not allowed to authenticate as {other_user}.
nl: Sorry, gebruiker {user} mag niet authenticeren als {other_user}
pl: Niestety, użytkownik {user} nie ma uprawnień do uwierzytelnienia się jako {other_user}.

source: No askpass program specified in SUDO_ASKPASS
nl: SUDO_ASKPASS bevatte geen askpass programma
pl: Nie określono programu pytającego o hasło w SUDO_ASKPASS

source: Askpass program '{path}' is not an absolute path
nl: Askpass programma '{path}' moet een absoluut pad zijn
pl: Program pytający o hasło „{path}” nie jest ścieżką absolutną

source: authenticate
nl: authenticatie
pl: uwierzytelnij

source: usage: sudo -h | -K | -k | -V usage: sudo [-BknS] [-p prompt] [-D directory] [-g group] [-u user] [-i | -s] [command [arg ...]] usage: sudo -v [-BknS] [-p prompt] [-g group] [-u user] usage: sudo -l [-BknS] [-p prompt] [-U user] [-g group] [-u user] [command [arg ...]] usage: sudo -e [-BknS] [-p prompt] [-D directory] [-g group] [-u user] file ...
nl: gebruik: sudo -h | -K | -k | -V gebruik: sudo [-BknS] [-p prompt] [-D map] [-g groep] [-u gebruiker] [-i | -s] [opdracht [arg ...]] gebruik: sudo -v [-BknS] [-p prompt] [-g groep] [-u gebruiker] gebruik: sudo -l [-BknS] [-p prompt] [-U gebruiker] [-g groep] [-u gebruiker] [opdracht [arg ...]] gebruik: sudo -e [-BknS] [-p prompt] [-D map] [-g groep] [-u gebruiker] bestand ...

source: sudo - run commands as another user
nl: sudo - voer opdrachten uit als een ander
pl: sudo - uruchamiaj polecenia jako inny użytkownik

source: Options: -B, --bell ring bell when prompting -D, --chdir=directory change the working directory before running command -g, --group=group run command as the specified group name or ID -h, --help display help message and exit -i, --login run login shell as the target user; a command may also be specified -K, --remove-timestamp remove timestamp file completely -k, --reset-timestamp invalidate timestamp file -l, --list list user's privileges or check a specific command; use twice for longer format -n, --non-interactive non-interactive mode, no prompts are used -p, --prompt=prompt use the specified password prompt -S, --stdin read password from standard input -s, --shell run shell as the target user; a command may also be specified -U, --other-user=user in list mode, display privileges for user -u, --user=user run command (or edit file) as specified user name or ID -V, --version display version information and exit -v, --validate update user's timestamp without running a command -- stop processing command line arguments
nl: Opties: -B, --bell geef audiosignaal voor een prompt -D, --chdir=directory wijzig de map voor uitvoering -g, --group=groep voer opdracht uit onder de bepaalde groep -h, --help geef dit bericht weer -i, --login open de login shell van de gebruiker -K, --remove-timestamp vergeet alle vorige authenticaties -k, --reset-timestamp vergeet een vorige authenticatie -l, --list toon de rechten van de gebruiker; tweemaal geeft een uitgebreider formaat -n, --non-interactive non-interactieve modus, zonder prompts -p, --prompt=prompt gebruik de gegeven wachtwoordprompt -S, --stdin lees het wachtwoord van standaardinvoer -s, --shell open de shell van de gebruiker -U, --other-user=gebruiker in lijstmodus, toon de rechten van deze gebruiker -u, --user=gebruiker voer de opdracht uit als deze gebruiker -V, --version geef versie-informatie weer -v, --validate hernieuw authenticatie zonder nieuwe opdracht -- stop met het verwerken van opties

source: usage: sudoedit -h | -V usage: sudoedit [-BknS] [-p prompt] [-g group] [-u user] file ...
nl: gebruik: sudoedit -h | -V gebruik: sudoedit [-BknS] [-p prompt] [-g group] [-u user] file ...
pl: użycie: sudoedit -h | -V użycie: sudoedit [-BknS] [-p monit] [-g grupa] [-u użytkownik] plik ...

source: sudoedit - edit files as another user
nl: sudoedit - bewerk bestanden als een ander
pl: sudoedit - edytuj pliki jako inny użytkownik

source: Options: -B, --bell ring bell when prompting -g, --group=group run command as the specified group name or ID -h, --help display help message and exit -k, --reset-timestamp invalidate timestamp file -n, --non-interactive non-interactive mode, no prompts are used -p, --prompt=prompt use the specified password prompt -S, --stdin read password from standard input -u, --user=user run command (or edit file) as specified user name or ID -V, --version display version information and exit -- stop processing command line arguments
nl: Opties: -B, --bell geef audiosignaal voor een prompt -g, --group=groep voer opdracht uit onder de bepaalde groep -h, --help geef dit bericht weer -k, --reset-timestamp vergeet een vorige authenticatie -n, --non-interactive non-interactieve modus, zonder prompts -p, --prompt=prompt gebruik de gegeven wachtwoordprompt -S, --stdin lees het wachtwoord van standaardinvoer -u, --user=gebruiker edit het bestand als deze gebruiker -V, --version geef versie-informatie weer -- stop met het verwerken van opties
pl: Opcje: -B, --bell włącza dzwonek podczas monitowania -g, --group=grupa uruchamia polecenie z podaną nazwą lub identyfikatorem grupy -h, --help wyświetla komunikat pomocy i kończy działanie -k, --reset-timestamp unieważnia plik znacznika czasu -n, --non-interactive tryb nieinteraktywny, bez monitów -p, --prompt=monit używa podanego monitu o hasło -S, --stdin odczytaje hasło ze standardowego wejścia -u, --user=użytkownik uruchamia polecenie (lub edytuje plik) z podaną nazwą lub identyfikatorem użytkownika -V, --version wyświetla informacje o wersji i kończy działanie -- kończy przetwarzanie argumentów wiersza poleceń

source: {context} cannot be used together with {option}
nl: {context} en {option} kunnen niet tegelijkertijd gebruikt worden
pl: {context} nie może być używany łącznie z {option}

source: must specify at least one file path
nl: verwacht tenminste één bestandsnaam
pl: należy określić co najmniej jedną ścieżkę do pliku

source: '{option}' flag must be accompanied by a command
nl: '{option}' flag moet gevolgd worden door een opdracht
pl: flaga „{option}” musi być połączona z poleceniem

source: command (positional argument)
nl: opdracht (als argument)
pl: polecenie (argument pozycyjny)

source: expected one of: --login, --shell, a command as a positional argument
nl: verwacht één van de volgende: --login, --shell, een opdracht als argument
pl: oczekiwano jednego z: --login, --shell, polecenie jako argument pozycyjny

source: '{option}' does not take any arguments
nl: '{option}' verwacht geen argumenten
pl: „{option}” nie przyjmuje żadnych argumentów

source: '{option}' expects an argument
nl: '{option}' verwacht een argument
pl: „{option}” oczekuje argumentu

source: invalid option '='
nl: ongeldige optie '='
pl: nieprawidłowa opcja „=”

source: expected one of these actions: --help, --version, --remove-timestamp, --validate, --list, --edit, --login, --shell, a command as a positional argument, --reset-timestamp
nl: gebruik een van deze acties: --help, --version, --remove-timestamp, --validate, --list, --edit, --login, --shell, een opdracht, --reset-timestamp
pl: oczekiwano jednego z następujących działań: --help, --version, --remove-timestamp, --validate, --list, --edit, --login, --shell, polecenie jako argument pozycyjny, --reset-timestamp

source: preserving the entire environment is not supported, '{flag}' is ignored
nl: de hele omgeving bewaren wordt niet ondersteund, '{flag}' is genegeerd
pl: zachowywanie całego środowiska nie jest obsługiwane, „{flag}” jest ignorowana

source: invalid option provided
nl: ongeldige optie
pl: podano nieprawidłową opcję

source: sudoedit doesn't need to be run via sudo
nl: sudoedit hoeft niet via sudo aangeroepen te worden
pl: sudoedit nie musi być uruchamiany przez sudo

source: command
nl: opdracht
pl: polecenie

source: environment variable
nl: omgevingsvariabele
pl: zmienna środowiskowa

source: failed to read metadata for {path}: {error}
nl: kan meta-data van {path} niet lezen: {error}
pl: nie udało się odczytać metadanych dla {path}: {error}

source: file {path} is not a regular file
nl: {path} is geen regulier bestand
pl: plik {path} nie jest zwykłym plikiem

source: failed to lock {path}: {error}
nl: kan geen lock krijgen op {path}: {error}
pl: nie udało się zablokować {path}: {error}

source: failed to read {path}: {error}
nl: kan {path} niet lezen: {error}
pl: nie udało się odczytać {path}: {error}

source: {path} unchanged
nl: {path} ongewijzigd
pl: {path} niezmieniono

source: failed to write {path}: {error}
nl: kan {path} niet schrijven: {error}
pl: nie udało się zapisać {path}: {error}

source: failed to remove temporary directory {path}: {error}
nl: kan tijdelijke map {path} niet verwijderen: {error}
pl: nie udało się usunąć katalogu tymczasowego {path}: {error}

source: failed to create temporary directory: {error}
nl: kan geen tijdelijke map maken: {error}
pl: nie udało się utworzyć katalogu tymczasowego: {error}

source: failed to create temporary directory {path}: {error}
nl: kan tijdelijke map {path} niet aanmaken: {error}
pl: nie udało się utworzyć katalogu tymczasowego {path}: {error}

source: failed to create temporary file {path}: {error}
nl: kan tijdelijk bestand {path} niet aanmaken: {error}
pl: nie udało się utworzyć pliku tymczasowego {path}: {error}

source: failed to write to temporary file {path}: {error}
nl: kan tijdelijk bestand {path} niet schrijven: {error}
pl: nie udało się zapisać do pliku tymczasowego {path}: {error}

source: failed to run editor {path}: {error}
nl: kan editor {path} niet starten: {error}
pl: nie udało się uruchomić edytora {path}: {error}

source: failed to read from temporary file {path}: {error}
nl: kan tijdelijk bestand {path} niet lezen: {error}
pl: nie udało się odczytać pliku tymczasowego {path}: {error}

source: failed to remove temporary file {path}: {error}
nl: kan tijdelijk bestand {path} niet verwijderen: {error}
pl: nie udało się usunąć pliku tymczasowego {path}: {error}

source: yn
nl: jn
pl: tn

source: sudoedit: truncate {path} to zero? (y/n) [n]
nl: sudoedit: {path} leegmaken? (j/n) [n]
pl: sudoedit: skrócić {path} do zera? (t/n) [n]

source: not overwriting {path}
nl: {path} wordt niet overschreven
pl: bez nadpisywania {path}

source: failed to write data to parent: {error}
nl: kon geen data schrijven naar het ouderproces: {error}
pl: nie udało się zapisać danych do nadrzędnego: {error}

source: Authentication failed, try again.
nl: Authenticatie mislukt, probeer opnieuw.
pl: Uwierzytelnianie się nie powiodło. Spróbuj ponownie.

source: sudoers file not found: {path} The sudoers file is required for sudo-rs to function. Please ensure: - The file exists at the expected location - You have the necessary permissions to read it - If setting up sudo-rs for the first time, create a sudoers file with appropriate permissions For more information, see the sudo-rs documentation.
nl: sudoersbestand niet gevonden op {path}
pl: Nie znaleziono pliku sudoers: {path} Plik sudoers jest wymagany do działania sudo-rs. Upewnij się, że: - plik znajduje się w oczekiwanej lokalizacji, - masz niezbędne uprawnienia do jego odczytu, - jeśli konfigurujesz sudo-rs po raz pierwszy, utwórz plik sudoers z odpowiednimi uprawnieniami. Więcej informacji znajdziesz w dokumentacji sudo-rs.

source: invalid configuration: {error}
nl: configuratiefout: {error}
pl: nieprawidłowa konfiguracja: {error}

source: {path}: editing symbolic links is not permitted
nl: symbolische links in {path} zijn niet toegestaan
pl: {path}: edycja dowiązań symbolicznych jest niedozwolona

source: error opening {path}: {error}
nl: kan {path} niet openen: {error}
pl: błąd otwierania ścieżki {path}: {error}

source: invalid path: {path}
nl: ongeldig pad: {path}
pl: nieprawidłowa ścieżka: {path}

source: please address the problems and try again
nl: los de problemen op en probeer opnieuw
pl: rozwiąż problem i spróbuj ponownie

source: User {user} may run the following commands on {hostname}:
nl: Gebruiker {user} mag de volgende opdrachten uitvoeren op {hostname}:
pl: Użytkownik {user} może uruchomić następujące polecenia na {hostname}:

source: User {user} is not allowed to run sudo on {hostname}.
nl: Gebruiker {user} mag sudo niet uitvoeren op {hostname}.
pl: Użytkownik {user} nie ma uprawnień do uruchamiania sudo na {hostname}.

source: Commands:
nl: Opdrachten:
pl: Polecenia:

source: Sudoers entry:
nl: Sudoers-regel:
pl: Wpis sudoers:

source: RunAsUsers
nl: RunAs-gebruikers
pl: RunAs-użytkownicy

source: RunAsGroups
nl: RunAs-groepen
pl: RunAs-grupy

source: Options
nl: Opties
pl: Opcje

source: {path} must be owned by root
nl: {path} moet eigendom zijn van root
pl: {path} musi być własnością roota

source: {path} cannot be group-writable
nl: {path} mag geen schrijfrechten aan de groep toekennen
pl: {path} nie może być zapisywalna przez grupę

source: {path} cannot be world-writable
nl: {path} mag geen universele schrijfrechten toekennen
pl: {path} nie może być zapisywalna przez wszystkich

source: {path} has no valid parent directory
nl: {path} bevindt zich niet in een geldige map
pl: {path} nie ma prawidłowego katalogu nadrzędnego

source: invalid path
nl: pad ongeldig
pl: nieprawidłowa ścieżka

source: path must be absolute
nl: pad moet absoluut zijn
pl: ścieżka musi być absolutna

source: cannot open a file in a path writable by the user
nl: kan geen bestand openen in een pad waarop de gebruiker schrijfrechten heeft
pl: nie można otworzyć pliku w ścieżce, do której użytkownik ma możliwość zapisu

source: error in provided path
nl: fout in het opgegeven pad
pl: błąd w podanej ścieżce

source: usage: sudo -h | -K | -k | -V usage: sudo [-ABbknS] [-p prompt] [-D directory] [-g group] [-u user] [-i | -s] [command [arg ...]] usage: sudo -v [-ABknS] [-p prompt] [-g group] [-u user] usage: sudo -l [-ABknS] [-p prompt] [-U user] [-g group] [-u user] [command [arg ...]] usage: sudo -e [-ABknS] [-p prompt] [-D directory] [-g group] [-u user] file ...
pl: użycie: sudo -h | -K | -k | -V użycie: sudo [-ABbknS] [-p monit] [-D katalog] [-g grupa] [-u użytkownik] [-i | -s] [polecenie [arg ...]] użycie: sudo -v [-ABknS] [-p monit] [-g grupa] [-u użytkownik] użycie: sudo -l [-ABknS] [-p monit] [-U użytkownik] [-g grupa] [-u użytkownik] [polecenie [arg ...]] użycie: sudo -e [-ABknS] [-p monit] [-D katalog] [-g grupa] [-u użytkownik] plik ...

source: Options: -A, --askpass use a helper program for password prompting -b, --background run command in the background -B, --bell ring bell when prompting -D, --chdir=directory change the working directory before running command -e, --edit edit files instead of running a command -g, --group=group run command as the specified group name or ID -h, --help display help message and exit -i, --login run login shell as the target user; a command may also be specified -K, --remove-timestamp remove timestamp file completely -k, --reset-timestamp invalidate timestamp file -l, --list list user's privileges or check a specific command; use twice for longer format -n, --non-interactive non-interactive mode, no prompts are used -p, --prompt=prompt use the specified password prompt -S, --stdin read password from standard input -s, --shell run shell as the target user; a command may also be specified -U, --other-user=user in list mode, display privileges for user -u, --user=user run command (or edit file) as specified user name or ID -V, --version display version information and exit -v, --validate update user's timestamp without running a command --preserve-env=list preserve specific environment variables -- stop processing command line arguments
pl: Opcje: -A, --askpass używa programu pomocniczego do wyświetlania monitu o hasło -b, --background uruchamia polecenie w tle -B, --bell włącza dzwonek podczas monitowania -D, --chdir=katalog zmienia katalog roboczy przed uruchomieniem polecenia -e, --edit edytuje pliki zamiast uruchamiania polecenia -g, --group=grupa uruchamia polecenie jako określoną nazwę grupy lub identyfikator -h, --help wyświetla komunikat pomocy i kończy -i, --login uruchamia powłokę logowania jako użytkownik docelowy; może również określić polecenie -K, --remove-timestamp całkowicie usuwa plik znacznika czasu -k, --reset-timestamp unieważnia plik znacznika czasu -l, --list wyświetla uprawnienia użytkownika lub sprawdza określone polecenie; dwukrotne użycie uzyskuje dłuższy format -n, --non-interactive nie wyświetla żadnych monitów w trybie nieinteraktywnym -p, --prompt=monit używa natychmiast określonego hasła -S, --stdin odczytuje hasło ze standardowego wejścia -s, --shell uruchamia powłokę jako użytkownik docelowy; może również określić polecenie -U, --other-user=użytkownik wyświetla uprawnienia użytkowników w trybie listy -u, --user=użytkownik uruchamia polecenie (lub edytuje plik) jako określoną nazwę użytkownika lub identyfikator -V, --version wyświetla informacje o wersji i kończy -v, --validate aktualizuje znacznik czasu użytkownika bez uruchamiania polecenia --preserve-env=lista zachowuje określone zmienne środowiskowe -- zatrzymaje przetwarzanie argumentów wiersza poleceń
